BASE_PATH = "/Users/paz/Documents/Code/Python/DoubanRobot"
IMG_PATH = BASE_PATH + '/verifier/imgs/'

USER_NAME = "1453090281@qq.com"
PASSWORD = "19980705Wxt"

RESP_CONTENT = [
    "我先在此一并道歉", "哎呀，啧", "简直胡扯瞎闹！", "世上没有解不开的结", "毫不知情 深表震惊", "我不是机器 我是有血有肉的 人", "没交往，没视频，没故事。", "瓦坎达forever",
    "不爱就拜拜，下一个更乖", "明年一定红！", "大家别担心，这件事我来处理！", "我很无语也很无奈", "我不是不能回复，我想的话可以一天回复一千条。", "机器人抽查！举起手来！", "怎么了呢", "生活善待你了么",
    "我不要你觉得，我要我觉得。", "他好像啊", "别酸了，反正谁都比你们强", "你啥也不是", "还tm拍！还tm拍！", "在吗，给我一亿", "不管怎样 希望大家都好吧", "I can't lose",
    "我会失望的，谢谢。", "我孤傲了一辈子", "摩西摩西", "奸巧语，秽污词，市井气，切戒之。", "厉害！真会玩！", "从想象中脱离出来吧，待在想象里不好", "别误会，只是在融梗", "这是一场单方面的屠杀。",
    "是爱是痴莫非真的你不懂？", "我就找个电动车维修论坛，发个贴子", "想发什么发什么。", "人工智能来了，人工智能真的来了", "只要你跑的快，你的房子就不会塌", "明天下午三点，朝阳公园东门见。记住，你一个人来。",
    "还tm控！还tm控！", "NNGT！", "且行且珍惜。", "天下间竟有这等的美事？", "我怎么会骗你呢，骗你是小猪。", "我犯了全天下男人都会犯的错。", "愿日后不再负人。", "这我哥，这我嫂子。",
    "你喜欢大海，我爱过你。", "一个人有多不正经，就有多深情。", "当事人的我们最清楚这段感情的珍贵与纯粹。", "我好像爱上了这片森林。", "暂停恋爱关系。", "我一直没有做太多跟他未来的设想",
    "没恋爱，别挡别的姑娘好姻缘。", "信女甄氏无才无德，不足以保养皇嗣，心怀感愧，无颜面圣，在此真心祝祷吾皇，得上天庇佑，平安喜乐，福泽万年，若得所愿，信女愿一生吃素，不再承宠", "人家是清清白白打工仔", "有点is",
    "Wow，上流社会？", "你是不是猹？是不是？", "量力而行", "正道的光亮瞎了我的眼", "多人运动五排吗？", "你有黑眼圈哎", "我看你像国家一级选手", "没有物质的爱情只是一盘沙", "把qq群交出来",
    "你买200张了吗？没有退群", "有人相爱 有人夜里开车看海", "刚入宫的甄嬛已经死了，臣妾，是钮祜禄甄嬛", "你有big胆", "还马还马，你养马场马的还不够多吗！", "那又怎么了", "小骚一下", "419吗",
    "小明的爷爷103岁了", "请喜马拉雅我组宠王明磊老师", "王明磊老师是最屌的！", "你百家号体吗？", "这两位真的希望他们结婚的人非常多", "好戏开场了", "我宣布熬夜比赛正式开始", "打工是不可能打工的",
    "双厨狂喜", "你有必胜的决心吗", "请直接往我嘴里种水稻", "正经人谁写日记啊", "境外势力 哪个 他妈的月球吗", "入秋了，天有些凉了呢！不如明天让王氏集团破产吧！", "与你有半毛钱瓜系吗？",
    "大专人 大专魂 大专都是人上人",
    "非杠非黑，狗头保命，纯属骚话，并无敌意，仅表达字面含义无讽刺、暗示意味，仅代表个人观点并无意引发论战及侵占公共资源，语言不当之处请见谅，本人尊重黑女穆同等一切团体，若本回复冒犯到您我诚挚表示歉意，若您不赞同我的观点不必特地回复我",
    "？？铁t去gay吧灭火？", "黑人抬棺材", "FBI!open the door!", "九折水瓶", "淡黄的长裙 蓬松的头发", "信不信我撕烂你的嘴皮子", "妹妹几岁了？可也上过学？现吃什么药？",
    "你在教我做事啊", "她不是漂不漂亮的问题，她真的是那种，那种很少见的那种", "老许，你要老婆不要？你要老婆，只要你开金口我一会给你送来！", "您是祖安人吗？", "“我读书少，你不要骗我”", "我想把这玩意染成绿的",
    "天天就是天天", "百因必有果", "我尼玛 爱嫂子"
]

INTERVAL = 1

GROUP_URL = "https://www.douban.com/group/dbwfcjz520/"

IP_UPDATE_INTERVAL = 3600 * 3